// ДЗ #19 до 16.10.23_ООП_UML_паттерны_(тест) Климов
/*
Курс: “Объектно-ориентированное
проектирование. Язык UML и паттерны
проектирования”
Тема: Введение
Домашнее задание
Задание 1. Вам будет дано 12 вопросов. Вам необходимо написать на них
ответы в текстовом документе и выслать его в качестве ответа на домашнее
задание. В качестве ответа нужно либо ответить “да” или “нет”, либо выбрать
правильный ответ из предложенных. Если Журнал не даёт вам выслать
домашнее задание в расширении .txt или .csv попробуйте поместить файл
внутрь архива и выслать архив.

1. Решило ли появление ООП все проблемы разработки программного
обеспечения?
Ответ: - нет

2. Приводит ли использование парадигм программирования к появлению
новых вычислительных мощностей для разработки?
Ответ: - нет

3. Процесс разбиения задачи на отдельные структурные части называется:
a. Абстрагирование
b. Декомпозиция
c. Моделирование
d. Имплементация
Ответ: b.
 
4. Иерархия в теории алгоритмов - это:
a. метод создания и управления совокупностями имён
b. отделение логическ ого смысла программы от её реализации
c. упорядоченная система абстракций
Ответ: c.

5. Какой оператор стараются избегать в современных языках
программирования:
a. goto
b. include
c. define
d. switch
Ответ: a.

6. Какие два понятия являются фундаментальными для ООП:
a. вещь и категория
b. экземпляр и тип
c. класс и объект
d. узел и родитель
Ответ: c.

7. Что не является одним из основных принципов ООП:
a. Инкапсуляция
b. Модульность
c. Наследование
d. Полиморфизм
Ответ: b.

8. Реализация - это часть инкапсулированного кода, скрытая от внешних
по отношению к нему объектов и пользователей?
Ответ: нет

9. Событийно-управляемая программа находится в вечном цикле
ожидания событий от пользователя или внешних программ?
Ответ: да

10. Какого этапа нет в жизненном цикле программы?
a. проектирования структуры программы
b. реализации программного кода
c. автоматизации разработки
d. внедрения программы
e. сопровождения программы
Ответ: с.

11. Как называют более крупную систему по отношению к её
подсистемам?
a. Надсистема
b. Суперсистема
c. Внешняя система
d. Метасистема
Ответ: d.

12. Правда ли, что при применении модели чёрного ящика, для внешних
систем доступны только входные и выходные данные моделируемой
системы?
Ответ: да



*/