// ДЗ #20 до 19.10.23_ООАП и UML - Классы и объекты.
/*
Задание 1. Вам будет дано 6 вопросов. Вам необходимо написать на них
ответы в текстовом документе и выслать его в качестве ответа на домашнее
задание. В качестве ответа нужно либо ответить “да” или “нет”, либо выбрать
правильный ответ из предложенных. Если Журнал не даёт вам выслать
домашнее задание в расширении .txt или .csv попробуйте поместить файл
внутрь архива и выслать архив.

1. Чем не обладает объект?
a. Состояние
b. Поведение
c. Отношение
d. Индивидуальность
Ответ: d.Индивидуальность

2. Определяет ли структура и поведение объект общий для них класс?
Ответ:да

3. Состояние объекта характеризуется динамическими значениями
статических свойств?
Ответ:да

4. Объект в рамках его класса характеризуют его переменные атрибуты?
Ответ:да

5. Для каждого объекта в рамках класса создаётся собственная операция?
Ответ:нет

6. Какую роль объекты не выполняют в рамках отношения?
a. Актёр
b. Сотрудник
c. Исполнитель
d. Агент
Ответ: b.Сотрудник

*/